#+title: Exercise 28
** Results

#+begin_src bash :exports both :results output
racket ./src/exercise-28.rkt
#+end_src

#+RESULTS:
: pass: 0 | 0 => 0 got: 0
: pass: 1 | 1 => 1 got: 1
: pass: 0 | 0 => 1 got: 1
: pass: 1 | 1 => 1 got: 1
: ok


Alright, we were able to show that we can create an or gate, and along with this, we built the required infrastructure to run the digital circuit simulator. The only missing feature here is that timing and clocks are not being simulated sufficiently. If there is anything that I know, it is that clocking matters a lot.
